Tekla Open API Reference for Tekla Structures 2025
AnalysisPartEnd.EccentricityModeEnum Enumeration
 The eccentricity modes of the part end.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum EccentricityModeEnum
Public Enumeration EccentricityModeEnum
Members
Member name | Value | Description
ECCENTRICITY_MODE_MANUAL | 0 |  The manual eccentricity mode.
ECCENTRICITY_MODE_AUTOMATIC | 1 |  The automatic eccentricity mode.
See Also
Reference
Tekla.Structures.Analysis Namespace